app/controllers/checklists_controller.rb

  def index
    @checklists = Checklist.all
---
SELECT "checklists".* FROM "checklists"

  def create
    @checklist = Checklist.new(checklist_params)

    if @checklist.save
---
INSERT INTO "checklists" ("task", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["task", "brainstorm dinner ideas for Christmas Eve"], ["created_at", "2020-12-08 04:10:20.602085"], ["updated_at", "2020-12-08 04:10:20.602085"]]

  def update
    if @checklist.update(checklist_params)
---
UPDATE "checklists" SET "task" = $1, "updated_at" = $2 WHERE "checklists"."id" = $3  [["task", "clean out car"], ["updated_at", "2020-12-12 04:41:11.249199"], ["id", 7]]

  def destroy
    @checklist.destroy
---
DELETE FROM "checklists" WHERE "checklists"."id" = $1  [["id", 1]]

    def set_checklist
      @checklist = Checklist.find(params[:id])
---
SELECT "checklists".* FROM "checklists" WHERE "checklists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]